; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob42) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate5)
	(at pallet1 distributor0)
	(clear crate2)
	(at pallet2 distributor1)
	(clear crate4)
	(at truck0 depot0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 365)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 228)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(= (weight crate0) 58)
	(at crate1 distributor0)
	(on crate1 crate0)
	(= (weight crate1) 73)
	(at crate2 distributor0)
	(on crate2 crate1)
	(= (weight crate2) 80)
	(at crate3 distributor1)
	(on crate3 pallet2)
	(= (weight crate3) 28)
	(at crate4 distributor1)
	(on crate4 crate3)
	(= (weight crate4) 92)
	(at crate5 depot0)
	(on crate5 pallet0)
	(= (weight crate5) 26)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate1 pallet2)
		(on crate2 pallet0)
		(on crate3 crate1)
		(on crate5 pallet1)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist0 crate5 pallet0 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 pallet0)
   added: (lifting hoist0 crate5) (clear pallet0)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 4
2. (load hoist0 crate5 truck0 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 26
   goals met: 0 of 4
3. (lift hoist2 crate4 crate3 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist2) (on crate4 crate3)
   added: (lifting hoist2 crate4) (clear crate3)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 4
4. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 2 to 12
   goals met: 0 of 4
5. (load hoist2 crate4 truck0 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck0) (available hoist2)
   changed: (current_load truck0) from 26 to 118
   goals met: 0 of 4
6. (lift hoist2 crate3 pallet2 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist2) (on crate3 pallet2)
   added: (lifting hoist2 crate3) (clear pallet2)
   changed: (fuel-cost) from 12 to 13
   goals met: 0 of 4
7. (load hoist2 crate3 truck0 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   changed: (current_load truck0) from 118 to 146
   goals met: 0 of 4
8. (lift hoist1 crate2 crate1 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist1) (on crate2 crate1)
   added: (lifting hoist1 crate2) (clear crate1)
   changed: (fuel-cost) from 13 to 14
   goals met: 0 of 4
9. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 14 to 24
   goals met: 0 of 4
10. (load hoist1 crate2 truck0 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck0) (available hoist1)
   changed: (current_load truck0) from 146 to 226
   goals met: 0 of 4
11. (unload hoist1 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist1)
   added: (lifting hoist1 crate3)
   changed: (current_load truck0) from 226 to 198
   goals met: 0 of 4
12. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 24 to 34
   goals met: 0 of 4
13. (unload hoist0 crate2 truck0 depot0)
   deleted: (in crate2 truck0) (available hoist0)
   added: (lifting hoist0 crate2)
   changed: (current_load truck0) from 198 to 118
   goals met: 0 of 4
14. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 34 to 44
   goals met: 0 of 4
15. (drop hoist0 crate2 pallet0 depot0)
   deleted: (lifting hoist0 crate2) (clear pallet0)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 pallet0)
   goals met: 1 of 4
16. (load hoist1 crate3 truck0 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   changed: (current_load truck0) from 118 to 146
   goals met: 1 of 4
17. (lift hoist1 crate1 crate0 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 crate0)
   added: (lifting hoist1 crate1) (clear crate0)
   changed: (fuel-cost) from 44 to 45
   goals met: 1 of 4
18. (load hoist1 crate1 truck0 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   changed: (current_load truck0) from 146 to 219
   goals met: 1 of 4
19. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 45 to 55
   goals met: 1 of 4
20. (unload hoist2 crate1 truck0 distributor1)
   deleted: (in crate1 truck0) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck0) from 219 to 146
   goals met: 1 of 4
21. (drop hoist2 crate1 pallet2 distributor1)
   deleted: (lifting hoist2 crate1) (clear pallet2)
   added: (available hoist2) (at crate1 distributor1) (clear crate1) (on crate1 pallet2)
   goals met: 2 of 4
22. (unload hoist2 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck0) from 146 to 118
   goals met: 2 of 4
23. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 55 to 65
   goals met: 2 of 4
24. (drop hoist2 crate3 crate1 distributor1)
   deleted: (lifting hoist2 crate3) (clear crate1)
   added: (available hoist2) (at crate3 distributor1) (clear crate3) (on crate3 crate1)
   goals met: 3 of 4
25. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   changed: (fuel-cost) from 65 to 66
   goals met: 3 of 4
26. (load hoist1 crate0 truck0 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   changed: (current_load truck0) from 118 to 176
   goals met: 3 of 4
27. (unload hoist1 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck0) from 176 to 150
   goals met: 3 of 4
28. (drop hoist1 crate5 pallet1 distributor0)
   deleted: (lifting hoist1 crate5) (clear pallet1)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 pallet1)
   goals met: 4 of 4
